-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Oct 05, 2024 at 01:39 PM
-- Server version: 10.8.4-MariaDB
-- PHP Version: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `node_shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `category_lang`
--

CREATE TABLE `category_lang` (
  `id` int(11) NOT NULL,
  `cid` int(11) NOT NULL,
  `lang` varchar(3) NOT NULL,
  `title` varchar(300) NOT NULL,
  `image` varchar(300) NOT NULL,
  `description` text NOT NULL,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `category_lang`
--

INSERT INTO `category_lang` (`id`, `cid`, `lang`, `title`, `image`, `description`, `created_at`, `updated_at`) VALUES
(1, 1, 'ua', 'Монітори', '17010_mac_monitor_screen_icon.png', 'Монітори є одним з основних елементів комп\\\'ютера. У першу увагу покупці зазвичай приділяють увагу процесору, відеокарті й обсягу пам\\\'яті. Дисплей відповідає за зручність під час використання ПК, тому важливо приділити його вибору особливу увагу.\\n\\nЗараз у продажу представлений широкий асортимент моделей, які відрізняються залежно від призначення. Окремо виділяють вироби для фотографів, геймерів і офісних працівників.\\n\\nЯк вибрати монітори для комп\\\'ютера?', 1702112326, 1702112326),
(2, 1, 'ru', 'Мониторы', '17010_mac_monitor_screen_icon.png', 'Мониторы являются одним из основных элементов компьютера. В первую очередь покупатели обычно уделяют внимание процессору, видеокарте и объему памяти. Дисплей отвечает за удобство при использовании ПК, поэтому важно уделить его выбору особое внимание. Сейчас в продаже представлен широкий ассортимент моделей, отличающихся в зависимости от назначения. Отдельно выделяют изделия для фотографов, геймеров и офисных работников. Как выбрать мониторы для компьютера?', 1702112326, 1702112326),
(3, 2, 'ua', 'Прінтери', '17023_printer_satish_icon.png', 'Принтери вже давно стали обов\\\'язковою частиною офісу, для студентів він необхідний. У побуті, для друку особистих документів або фотографій він не стане зайвим. Проте, при виборі принтера часом виникають питання - на якій технології зупинитися, яку функціональність має пристрій, а за що не варто переплачувати. Далі ви знайдете поради, як зробити правильний вибір.', 1702112326, 1702112326),
(4, 2, 'ru', 'Принтеры', '17023_printer_satish_icon.png', 'Принтеры уже давно стали обязательной частью офиса, для студентов он необходим. В обиходе, для печати личных документов или фотографий он не станет лишним. Однако, при выборе принтера иногда возникают вопросы – на какой технологии остановиться, какую функциональность имеет устройство, а за что не стоит переплачивать. Далее вы найдете советы, как сделать верный выбор.', 1702112326, 1702112326),
(5, 3, 'ua', 'Канцелярія', '17012_edit_pen_write_icon.png', 'Забезпечення нормальної роботи офісу - це окрема і до того ж значна стаття витрат компанії. Підбір надійних постачальників канцелярії, офісної техніки, госптоварів та навіть продуктів для кухні забирає чимало часу менеджера чи помічника керівника.', 1702112326, 1702112326),
(6, 3, 'ru', 'Канцелярия', '17012_edit_pen_write_icon.png', 'Обеспечение нормальной работы офиса - это отдельная и, к тому же, значительная статья расходов компании. Подбор надежных поставщиков канцелярии, офисной техники, хозтоваров и даже продуктов для кухни отбирает немало времени менеджера или помощника руководителя.', 1702112326, 1702112326),
(7, 4, 'ua', 'Ноутбуки', '60879_computer_laptop_notebook_icon.png', 'Ноутбук — портативний комп\\\'ютер, яким можна використовувати для навчання, розваг або роботи. На відміну від стаціонарного ПК, лептопи здатні запропонувати своєму власникові низку переваг:\\n\\nНевелика вага та габарити — сучасні ноутбуки важать від 1 до 2.5 кг, завдяки чому їх вкрай зручно брати з собою на роботу, в подорожі, відрядження.\\nЦе повністю самостійний і готовий до використання пристрій, для якого не потрібно нічого докуповувати. Тут є дисплей, тачпад, клавіатура, динаміки, мікрофон, Wi-Fi-модуль і навіть вебкамера — усі базові атрибути, необхідні для початку роботи.', 1702112326, 1702112326),
(8, 4, 'ru', 'Ноутбуки', '60879_computer_laptop_notebook_icon.png', 'Ноутбук – портативный компьютер, которым можно использовать для обучения, развлечений или работы. В отличие от стационарного ПК, лэптопы способны предложить своему владельцу ряд преимуществ: Небольшой вес и габариты — современные ноутбуки весят от 1 до 2.5 кг, благодаря чему их крайне удобно брать с собой на работу, в путешествии, командировки. самостоятельное и готовое к использованию устройство, для которого не нужно ничего докупать. Здесь есть дисплей, тачпад, клавиатура, динамики, микрофон, Wi-Fi-модуль и даже вебкамера – все базовые атрибуты, необходимые для начала работы.', 1702112326, 1702112326),
(9, 5, 'ua', 'Митцю', '17022_colors_draw_paint_icon.png', 'Акрилові фарби – відносно новий винахід людства. На відміну від масляних, яким уже багато століть, акрил з нами навіть менший за сотню років. Тим не менш, він встиг завоювати величезну кількість шанувальників по всьому світу. Сьогодні популярність акрилу не зменшується, а тільки зростає і на те вагомі причини. Чим же такий гарний акрил?', 1702112326, 1702112326),
(10, 5, 'ru', 'Художнику', '17022_colors_draw_paint_icon.png', 'Акриловые краски – относительно новое изобретение человечества. В отличие от масляных, которым уже много веков, акрил с нами даже меньше сотни лет. Тем не менее он успел завоевать огромное количество поклонников по всему миру. Сегодня популярность акрила не убывает, а только возрастает и на то есть веские причины. Чем же так хорош акрил?', 1702112326, 1702112326),
(11, 6, 'ua', 'Комп\'ютери Apple', '60884_apple_computer_imac_mac_icon.png', 'Корпорація Apple – найбільш успішний виробник мобільних пристроїв, настільних рішень, розробник програмного забезпечення та цифрового контенту. У користувачів гаджети «яблучної» компанії асоціюються з приємним досвідом використання, плавною та безпроблемною роботою. Завдяки тривалій підтримці смартфони, лептопи та комп\'ютери залишаються актуальними понад 5 років.', 1702112326, 1702112326),
(12, 6, 'ru', 'Компьютеры Apple', '60884_apple_computer_imac_mac_icon.png', 'Корпорация Apple — наиболее успешный производитель мобильных устройств, настольных решений, разработчик программного обеспечения и цифрового контента. У пользователей гаджеты «яблочной» компании ассоциируются с приятным опытом использования, плавной и беспроблемной работой. Благодаря длительной поддержке смартфоны, лэптопы и компьютеры остаются актуальными больше 5 лет.', 1702112326, 1702112326),
(13, 7, 'ua', 'Меблі', '60885_chair_furniture_icon.png', 'Меблі є незмінним атрибутом будь-якого приміщення. Саме вони задають йому правильну атмосферу, роблячи простір затишним і комфортним, створюючи сприятливі умови для продуктивної роботи або допомагаючи відпочити після важкого дня. Все частіше клієнти воліють оформляти замовлення в інтернет магазині меблів, коли можна у вільний час сісти за комп\\\'ютер, розглянути меблі на фото і спокійно купити меблі в Одесі, які вам сподобалися. Інтернет магазин Табуретка має великий каталог меблів: в наявності є як меблі Львів для будинку, так і для офісу.', 1702112326, 1702112326),
(14, 7, 'ru', 'Мебель', '60885_chair_furniture_icon.png', 'Меблі є незмінним атрибутом будь-якого приміщення. Саме вони задають йому правильну атмосферу, роблячи простор затишним і комфортним, створюючи сприятливі умови для продуктивної роботи або допомагаючи відпочити після важкого дня. Все частіше клієнти воліють оформляти замовлення в інтернет магазині меблів, коли можна у вільну годину сісти за комп\'ютер, розглянути меблі на фото та спокійно купити меблі в Одесі, які вам понравилися. Інтернет магазин Табуретка має великий каталог меблів: в наявності є як меблі для дому, так і для офісу.', 1702112326, 1702112326);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category_lang`
--
ALTER TABLE `category_lang`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cid` (`cid`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `category_lang`
--
ALTER TABLE `category_lang`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `category_lang`
--
ALTER TABLE `category_lang`
  ADD CONSTRAINT `category_id` FOREIGN KEY (`cid`) REFERENCES `category` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
